import React from 'react';
import './Questions.css'
const Questions = () => {
    return (
        <div className='container'>
            <div className="question1">
                <h4>1. How React works</h4>
                <div>
                    <p>
                        রিয়েক্ট হলো একটি জাভাস্ক্রিপ্ট লাইব্রেরি। রিয়েক্ট এ কোন কিছু করলে সেটা রেন্ডার মেথড এর
                        মাধ্যমে রেন্ডার হয়ে ডাটা আউটপুট দেয়। রিয়েক্ট সব গুলো কোম্পনেন্ট কে নিয়ে একটি ভার্চুয়াল
                        ডোম(DOM) তৈরি করে। আমরা যখন রিয়েক্ট এ কোন স্টেট চেঞ্জ করি বা ডাটা পরিবর্তন করি তখন 
                        রিয়েন্ট তার তৈরি করা ভার্চুয়াল ডোম(DOM) এর সাথে আসল ডোম(DOM) এর পার্থক্য দেখে, যে কোথায় 
                        কোথায় চেঞ্জ হয়েছে।তার পর চেঞ্জ হয়া গুলো সনাক্ত করে আসল ডোম(DOM) এ উপডেট করে দেয়। এই
                        পদ্ধতিতেই রিয়েক্ট কাজ করে। 
                    </p>
                </div>
            </div>
            <div className="question2">
            <div>
                <h4>2. Props Vs State</h4>
                <strong>Props</strong>
                    <ul>
                        <li>প্রোপস(Props) হলো ইমিউটেবল মানে অপরিবর্তনীয়।</li>
                        <li>প্রোপস(Props) চাইল্ড কোম্পনেন্ট মাধ্যমে ব্যাবহার করা যায়।</li>
                        <li>স্টেট বিহীন কোম্পনেটেও প্রোপস(Props) থাকতে পারে।</li>
                    </ul>
                    <strong>Props</strong>
                    <ul>
                        <li>স্টেট(state) হলো মিউটেবল মানে পরিবর্তনীয়।</li>
                        <li>স্টেট(state) চাইল্ড কোম্পনেন্ট মাধ্যমে ব্যাবহার করা যায় না।</li>
                        <li>স্টেট বিহীন কোম্পনেটেও প্রোপস(Props) থাকতে পারে না।</li> 
                    </ul>
                </div>
            </div>
        </div>
    );
};

export default Questions; 